{
  "ui": {
    "buttonText": "Pause",
    "defaultHeroTexts": [
      "You deserve this moment.",
      "The world can wait for you.",
      "Breathe, then continue.",
      "This moment belongs to you.",
      "Slow down, feel existence."
    ],
    "fallbackMessage": "Click the button to get a gentle pause suggestion.",
    "logo": "Pause",
    "github": "GitHub",
    "language": "Language",
    "theme": "Theme"
  },
  "culture": {
    "title": "Design Philosophy",
    "sections": [
      {
        "title": "Minimalist",
        "description": "Just one button, no clutter. Focus on core experience, let technology fade away, humanity shine."
      },
      {
        "title": "Humanistic",
        "description": "Not an efficiency tool, but an emotional regulator. In an accelerating world, reclaim the right to breathe."
      },
      {
        "title": "Free",
        "description": "No login required, no data collection, runs locally. Your pause belongs entirely to you."
      }
    ]
  },
  "footer": {
    "version": "v0.0.1",
    "links": {
      "github": "https://github.com/yourusername/pause-button",
      "docs": "#",
      "about": "#"
    },
    "copyright": "Released under the MIT License."
  },
  "suggestions": [
    "Look out the window and watch the clouds for 1 minute.",
    "Take a sip of water. Feel its warmth as it flows down your throat.",
    "Send a text to your past self: 'You're doing great.'",
    "Play music—just the chorus part.",
    "Pretend you're a new intern. Observe your desk with fresh eyes.",
    "Take three deep breaths. Inhale for 4 seconds, exhale for 6 seconds.",
    "Write down what's making you anxious right now, then tear it up.",
    "Close your eyes and recall a moment that made you laugh.",
    "Walk to the nearest plant and say thank you to it.",
    "Pause work just to appreciate the sunlight right now.",
    "Open your notes app and write a line of poetry (even if it's bad).",
    "Turn your phone face down and sit quietly for 30 seconds.",
    "Imagine you're teaching someone how to do your current job. How would you explain it?",
    "Go pour a cup of warm water and drink it slowly.",
    "Look into the distance and let your eyes relax their focus.",
    "Gently rotate your shoulders to release tension there.",
    "Recall the first thought you had when you woke up this morning.",
    "Write a character with your non-dominant hand and feel the clumsy focus.",
    "Smell the back of your hand. Do you smell coffee or paper?",
    "Say a sincere thank you to a colleague in your heart.",
    "Look at today's date and remember it—this is another day you've lived.",
    "Place your hand on your chest and feel your heartbeat.",
    "Imagine you're standing on a mountaintop with wind blowing through your hair.",
    "Delete a social media draft you've been hesitating to post.",
    "Turn down your screen brightness a bit and be gentle with your eyes.",
    "Silently list three small things you've already accomplished today.",
    "Stand up, rise on your toes for 10 seconds, then slowly lower.",
    "Imagine your stress is a leaf floating away with the water.",
    "Open a window and listen to the sounds outside for 30 seconds.",
    "Tap your fingertips lightly on the desk like playing a silent melody.",
    "Recall your favorite afternoon from childhood.",
    "Pull your chair back a bit to give yourself more space.",
    "Tell yourself: 'I've done well enough.'",
    "Observe an object near your hand and find three details you've never noticed.",
    "Close your eyes and imagine lying on soft grass.",
    "Change your computer wallpaper to a solid color (like light gray or beige).",
    "Write 'I allow myself to rest' and read it three times.",
    "Gently massage your temples for 10 seconds.",
    "Think about what made you genuinely smile recently.",
    "Push your keyboard away and fold your hands on the desk.",
    "Draw a circle on paper without lifting your pen.",
    "Recall a small thing you did to help someone else.",
    "Look at your fingers—they've done a lot for you today.",
    "Imagine floating on warm ocean water.",
    "Take off your headphones and let your ears rest.",
    "Count five breaths silently, focusing only on the air moving in and out.",
    "Write an encouraging message to your future self and save it as a draft.",
    "Rotate your ankles, 5 times each direction.",
    "Look at the ceiling and find a corner you usually ignore.",
    "Imagine your thoughts are a flock of birds flying away.",
    "Hum a childhood song quietly.",
    "Set your phone to grayscale (in settings) to reduce stimulation.",
    "Recall how you felt when you received your first paycheck.",
    "Wipe your screen with a tissue—also wipe clear your attention.",
    "Tell yourself: 'This isn't escaping, it's recharging.'",
    "Watch how bubbles in a glass of water rise and burst.",
    "Try placing your mouse on the left side (if you're right-handed).",
    "Imagine sitting in the quietest corner of a library.",
    "Gently pat your thigh like comforting a friend.",
    "Write 'Right now, I am safe' and stick it to your monitor edge.",
    "Close your eyes and imagine being wrapped in sunlight.",
    "Fold up your task list so you can't see it temporarily.",
    "Recall the last time you felt calm.",
    "Press your tongue against the roof of your mouth and feel this subtle action.",
    "Look at your shadow—it's been silently accompanying you.",
    "Imagine your brain is a forest with wind gently blowing through.",
    "Spin your chair around once to see the world from a different angle.",
    "Rub your hands together to warm them, then cover your eyes for 3 seconds.",
    "Recall the origin of your name and what expectations it carries.",
    "Turn your computer volume to the lowest and enter silent mode.",
    "Plant a flower in your heart, water it, and let it bask in sunlight.",
    "Observe how your breathing makes your clothes slightly rise and fall.",
    "Imagine sitting by a train window watching scenery pass by.",
    "Fold a sticky note into a boat and place it on your desk corner.",
    "Gently bite your lip to feel the reality of existence.",
    "Recall the last time you were completely immersed in doing something.",
    "Stop your cursor in a blank space and write nothing.",
    "Imagine your exhaustion is a piece of ice slowly melting.",
    "Take a deep breath through your nose and exhale slowly through your mouth.",
    "Check your shoelaces—are they loose? Tighten them, and tighten yourself too.",
    "Say to the world in your heart: 'I need a minute.'",
    "Minimize all windows on your screen, leaving only blank space.",
    "Recall your favorite season—where is it right now?",
    "Gently shake your head as if shaking off excess thoughts.",
    "Imagine standing in rain, but the rain is warm.",
    "Touch the F and J keys on your keyboard—that's the way home.",
    "Close your eyes and count how many flower names you can still remember.",
    "Tell yourself: 'I don't need to be perfect, I just need to exist.'",
    "Observe your breath—does it form mist on cold days?",
    "Move your mouse pointer to the center of the screen and just watch it.",
    "Imagine your attention is a beam of light—now let it scatter.",
    "Gently shrug your shoulders, then completely relax, repeat three times.",
    "Recall the last time someone sincerely praised you.",
    "Close your laptop (if possible) and face only yourself for 10 seconds.",
    "Play a song in your heart that only you can hear.",
    "Look at your wrist—there's a pulse there, and also time.",
    "Imagine lying in snow, making a snow angel.",
    "Touch the desk with your fingertips and feel the texture of wood or metal.",
    "Tell yourself: 'This minute belongs to me.'"
  ]
}
